; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared2 - mode
	thermograph5 - mode
	spectrograph0 - mode
	image4 - mode
	spectrograph1 - mode
	infrared3 - mode
	GroundStation0 - direction
	Star4 - direction
	Star2 - direction
	GroundStation3 - direction
	Star1 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image4)
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph5)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
)
(:goal (and
	(pointing satellite0 Phenomenon5)
	(have_image Phenomenon5 infrared3)
	(have_image Phenomenon6 image4)
	(have_image Phenomenon6 thermograph5)
	(have_image Star7 image4)
	(have_image Star7 spectrograph0)
	(have_image Star8 image4)
	(have_image Star8 spectrograph1)
	(have_image Star9 spectrograph0)
	(have_image Star9 infrared3)
	(have_image Planet10 image4)
	(have_image Planet10 thermograph5)
	(have_image Phenomenon11 infrared3)
	(have_image Phenomenon11 thermograph5)
	(have_image Star12 spectrograph0)
	(have_image Phenomenon13 spectrograph1)
	(have_image Phenomenon13 infrared2)
	(have_image Planet14 spectrograph1)
	(have_image Planet15 infrared3)
	(have_image Planet16 spectrograph0)
))

)

; plan
1. (turn_to satellite0 star2 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star2)
   goals met: 0 of 20
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 20
3. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 20
4. (turn_to satellite0 star8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star8)
   goals met: 0 of 20
5. (take_image satellite0 star8 instrument0 image4)
   added: (have_image star8 image4)
   goals met: 1 of 20
6. (turn_to satellite0 star7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star7)
   goals met: 1 of 20
7. (take_image satellite0 star7 instrument0 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 2 of 20
8. (take_image satellite0 star7 instrument0 image4)
   added: (have_image star7 image4)
   goals met: 3 of 20
9. (turn_to satellite0 star12 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star12)
   goals met: 3 of 20
10. (take_image satellite0 star12 instrument0 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 4 of 20
11. (turn_to satellite0 planet16 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet16)
   goals met: 4 of 20
12. (take_image satellite0 planet16 instrument0 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 5 of 20
13. (turn_to satellite0 planet10 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet10)
   goals met: 5 of 20
14. (take_image satellite0 planet10 instrument0 image4)
   added: (have_image planet10 image4)
   goals met: 6 of 20
15. (turn_to satellite0 phenomenon6 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon6)
   goals met: 6 of 20
16. (take_image satellite0 phenomenon6 instrument0 image4)
   added: (have_image phenomenon6 image4)
   goals met: 7 of 20
17. (turn_to satellite0 groundstation3 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 groundstation3)
   goals met: 7 of 20
18. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 7 of 20
19. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 7 of 20
20. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 7 of 20
21. (turn_to satellite0 phenomenon11 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon11)
   goals met: 7 of 20
22. (take_image satellite0 phenomenon11 instrument1 thermograph5)
   added: (have_image phenomenon11 thermograph5)
   goals met: 8 of 20
23. (turn_to satellite0 phenomenon13 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon13)
   goals met: 8 of 20
24. (take_image satellite0 phenomenon13 instrument1 infrared2)
   added: (have_image phenomenon13 infrared2)
   goals met: 9 of 20
25. (take_image satellite0 phenomenon13 instrument1 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 10 of 20
26. (turn_to satellite0 phenomenon6 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon6)
   goals met: 10 of 20
27. (take_image satellite0 phenomenon6 instrument1 thermograph5)
   added: (have_image phenomenon6 thermograph5)
   goals met: 11 of 20
28. (turn_to satellite0 planet10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet10)
   goals met: 11 of 20
29. (take_image satellite0 planet10 instrument1 thermograph5)
   added: (have_image planet10 thermograph5)
   goals met: 12 of 20
30. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 12 of 20
31. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 12 of 20
32. (turn_to satellite0 star1 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star1)
   goals met: 12 of 20
33. (calibrate satellite0 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 12 of 20
34. (turn_to satellite0 phenomenon11 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon11)
   goals met: 12 of 20
35. (take_image satellite0 phenomenon11 instrument2 infrared3)
   added: (have_image phenomenon11 infrared3)
   goals met: 13 of 20
36. (turn_to satellite0 planet14 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet14)
   goals met: 13 of 20
37. (take_image satellite0 planet14 instrument2 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 14 of 20
38. (turn_to satellite0 planet15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet15)
   goals met: 14 of 20
39. (take_image satellite0 planet15 instrument2 infrared3)
   added: (have_image planet15 infrared3)
   goals met: 15 of 20
40. (turn_to satellite0 star8 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star8)
   goals met: 15 of 20
41. (take_image satellite0 star8 instrument2 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 16 of 20
42. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 16 of 20
43. (take_image satellite0 star9 instrument2 infrared3)
   added: (have_image star9 infrared3)
   goals met: 17 of 20
44. (take_image satellite0 star9 instrument2 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 18 of 20
45. (turn_to satellite0 phenomenon5 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon5)
   goals met: 19 of 20
46. (take_image satellite0 phenomenon5 instrument2 infrared3)
   added: (have_image phenomenon5 infrared3)
   goals met: 20 of 20
